zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE316/MCXE316_COMMON.h
/*******************************************************************************
 * Definitions
*******************************************************************************/

/*!
 * @brief Structure for the TSPC group1
 *
 * Defines the structure for the TSPC group1 pads.
 */
typedef enum _tspc_group1_pads
{
    kTSPC_Group1PTD1                = (uint64_t)(1ULL << 0), /**< TSPC pad mask PTD1 in group 1 */
    kTSPC_Group1PTD0                = (uint64_t)(1ULL << 1), /**< TSPC pad mask PTD0 in group 1 */
    kTSPC_Group1PTB3                = (uint64_t)(1ULL << 2), /**< TSPC pad mask PTB3 in group 1 */
    kTSPC_Group1PTB2                = (uint64_t)(1ULL << 3), /**< TSPC pad mask PTB2 in group 1 */
    kTSPC_Group1PTB1                = (uint64_t)(1ULL << 4), /**< TSPC pad mask PTB1 in group 1 */
    kTSPC_Group1PTB0                = (uint64_t)(1ULL << 5), /**< TSPC pad mask PTB0 in group 1 */
    kTSPC_Group1PTC9                = (uint64_t)(1ULL << 6), /**< TSPC pad mask PTC9 in group 1 */
    kTSPC_Group1PTC8                = (uint64_t)(1ULL << 7), /**< TSPC pad mask PTC8 in group 1 */
    kTSPC_Group1PTA7                = (uint64_t)(1ULL << 8), /**< TSPC pad mask PTA7 in group 1 */
    kTSPC_Group1PTB13               = (uint64_t)(1ULL << 9), /**< TSPC pad mask PTB13 in group 1 */
    kTSPC_Group1PTD3                = (uint64_t)(1ULL << 10), /**< TSPC pad mask PTD3 in group 1 */
    kTSPC_Group1PTD2                = (uint64_t)(1ULL << 11), /**< TSPC pad mask PTD2 in group 1 */
    kTSPC_Group1PTE16               = (uint64_t)(1ULL << 12), /**< TSPC pad mask PTE16 in group 1 */
    kTSPC_Group1PTE15               = (uint64_t)(1ULL << 13), /**< TSPC pad mask PTE15 in group 1 */
    kTSPC_Group1PTE11               = (uint64_t)(1ULL << 14), /**< TSPC pad mask PTE11 in group 1 */
    kTSPC_Group1PTE10               = (uint64_t)(1ULL << 15), /**< TSPC pad mask PTE10 in group 1 */
    kTSPC_Group1PTC12               = (uint64_t)(1ULL << 16), /**< TSPC pad mask PTC12 in group 1 */
    kTSPC_Group1PTC11               = (uint64_t)(1ULL << 17), /**< TSPC pad mask PTC11 in group 1 */
    kTSPC_Group1PTC10               = (uint64_t)(1ULL << 18), /**< TSPC pad mask PTC10 in group 1 */
    kTSPC_Group1PTA6                = (uint64_t)(1ULL << 19), /**< TSPC pad mask PTA6 in group 1. */
    kTSPC_Group1PTB17               = (uint64_t)(1ULL << 20), /**< TSPC pad mask PTB17 in group 1 */
    kTSPC_Group1PTB15               = (uint64_t)(1ULL << 21), /**< TSPC pad mask PTB15 in group 1 */
    kTSPC_Group1PTB14               = (uint64_t)(1ULL << 22), /**< TSPC pad mask PTB14 in group 1 */
    kTSPC_Group1PTB12               = (uint64_t)(1ULL << 23), /**< TSPC pad mask PTB12 in group 1 */
    kTSPC_Group1PTD4                = (uint64_t)(1ULL << 24), /**< TSPC pad mask PTD4 in group 1 */
    kTSPC_Group1PTA18               = (uint64_t)(1ULL << 25), /**< TSPC pad mask PTA18 in group 1 */
    kTSPC_Group1PTA19               = (uint64_t)(1ULL << 26), /**< TSPC pad mask PTA19 in group 1 */
    kTSPC_Group1PTA20               = (uint64_t)(1ULL << 27), /**< TSPC pad mask PTA20 in group 1 */
    kTSPC_Group1PTA21               = (uint64_t)(1ULL << 28), /**< TSPC pad mask PTA21 in group 1 */
    kTSPC_Group1PTE5                = (uint64_t)(1ULL << 29), /**< TSPC pad mask PTE5 in group 1 */
    kTSPC_Group1PTE4                = (uint64_t)(1ULL << 30), /**< TSPC pad mask PTE4 in group 1 */
    kTSPC_Group1PTC21               = (uint64_t)(1ULL << 31), /**< TSPC pad mask PTC21 in group 1 */
    kTSPC_Group1PTC23               = (uint64_t)(1ULL << 32), /**< TSPC pad mask PTC23 in group 1 */
    kTSPC_Group1PTC24               = (uint64_t)(1ULL << 33), /**< TSPC pad mask PTC24 in group 1 */
    kTSPC_Group1PTC25               = (uint64_t)(1ULL << 34), /**< TSPC pad mask PTC25 in group 1 */
    kTSPC_Group1PTC26               = (uint64_t)(1ULL << 35), /**< TSPC pad mask PTC26 in group 1 */
    kTSPC_Group1PTC27               = (uint64_t)(1ULL << 36), /**< TSPC pad mask PTC27 in group 1 */
    kTSPC_Group1PTC28               = (uint64_t)(1ULL << 37), /**< TSPC pad mask PTC28 in group 1 */
    kTSPC_Group1PTC29               = (uint64_t)(1ULL << 38), /**< TSPC pad mask PTC29 in group 1 */
    kTSPC_Group1PTC30               = (uint64_t)(1ULL << 39), /**< TSPC pad mask PTC30 in group 1 */
    kTSPC_Group1PTC31               = (uint64_t)(1ULL << 40), /**< TSPC pad mask PTC31 in group 1 */
    kTSPC_Group1PTE7                = (uint64_t)(1ULL << 41), /**< TSPC pad mask PTE7 in group 1 */
    kTSPC_Group1PTA17               = (uint64_t)(1ULL << 42), /**< TSPC pad mask PTA17 in group 1 */
    kTSPC_Group1PTD20               = (uint64_t)(1ULL << 43), /**< TSPC pad mask PTD20 in group 1 */
    kTSPC_Group1PTD21               = (uint64_t)(1ULL << 44), /**< TSPC pad mask PTD21 in group 1 */
    kTSPC_Group1PTD22               = (uint64_t)(1ULL << 45), /**< TSPC pad mask PTD22 in group 1 */
} tspc_group1_pads_t;

/*!
 * @brief Structure for the TSPC group2
 *
 * Defines the structure for the TSPC group2 pads.
 */
typedef enum _tspc_group2_pads
{
    kTSPC_Group2PTA3                = (uint64_t)(1ULL << 0), /**< TSPC pad mask PTA3 in group 2 */
    kTSPC_Group2PTA2                = (uint64_t)(1ULL << 1), /**< TSPC pad mask PTA2 in group 2 */
    kTSPC_Group2PTA0                = (uint64_t)(1ULL << 2), /**< TSPC pad mask PTA0 in group 2 */
    kTSPC_Group2PTC7                = (uint64_t)(1ULL << 3), /**< TSPC pad mask PTC7 in group 2 */
    kTSPC_Group2PTA13               = (uint64_t)(1ULL << 4), /**< TSPC pad mask PTA13 in group 2 */
    kTSPC_Group2PTA11               = (uint64_t)(1ULL << 5), /**< TSPC pad mask PTA11 in group 2 */
    kTSPC_Group2PTA10               = (uint64_t)(1ULL << 6), /**< TSPC pad mask PTA10 in group 2 */
    kTSPC_Group2PTC5                = (uint64_t)(1ULL << 7), /**< TSPC pad mask PTC5 in group 2 */
    kTSPC_Group2PTA4                = (uint64_t)(1ULL << 8), /**< TSPC pad mask PTA4 in group 2 */
    kTSPC_Group2PTB11               = (uint64_t)(1ULL << 9), /**< TSPC pad mask PTB11 in group 2 */
    kTSPC_Group2PTB10               = (uint64_t)(1ULL << 10), /**< TSPC pad mask PTB10 in group 2 */
    kTSPC_Group2PTB9                = (uint64_t)(1ULL << 11), /**< TSPC pad mask PTB9 in group 2 */
    kTSPC_Group2PTB8                = (uint64_t)(1ULL << 12), /**< TSPC pad mask PTB8 in group 2 */
    kTSPC_Group2PTA16               = (uint64_t)(1ULL << 13), /**< TSPC pad mask PTA16 in group 2 */
    kTSPC_Group2PTA15               = (uint64_t)(1ULL << 14), /**< TSPC pad mask PTA15 in group 2 */
    kTSPC_Group2PTE6                = (uint64_t)(1ULL << 15), /**< TSPC pad mask PTE6 in group 2 */
    kTSPC_Group2PTE2                = (uint64_t)(1ULL << 16), /**< TSPC pad mask PTE2 in group 2 */
    kTSPC_Group2PTA14               = (uint64_t)(1ULL << 17), /**< TSPC pad mask PTA14 in group 2 */
    kTSPC_Group2PTE1                = (uint64_t)(1ULL << 18), /**< TSPC pad mask PTE1 in group 2 */
    kTSPC_Group2PTE0                = (uint64_t)(1ULL << 19), /**< TSPC pad mask PTE0 in group 2 */
    kTSPC_Group2PTA9                = (uint64_t)(1ULL << 20), /**< TSPC pad mask PTA9 in group 2 */
    kTSPC_Group2PTA12               = (uint64_t)(1ULL << 21), /**< TSPC pad mask PTA12 in group 2 */
    kTSPC_Group2PTD23               = (uint64_t)(1ULL << 22), /**< TSPC pad mask PTD23 in group 2 */
    kTSPC_Group2PTD24               = (uint64_t)(1ULL << 23), /**< TSPC pad mask PTD24 in group 2 */
    kTSPC_Group2PTD26               = (uint64_t)(1ULL << 24), /**< TSPC pad mask PTD26 in group 2 */
    kTSPC_Group2PTD27               = (uint64_t)(1ULL << 25), /**< TSPC pad mask PTD27 in group 2 */
    kTSPC_Group2PTD28               = (uint64_t)(1ULL << 26), /**< TSPC pad mask PTD28 in group 2 */
    kTSPC_Group2PTD29               = (uint64_t)(1ULL << 27), /**< TSPC pad mask PTD29 in group 2 */
    kTSPC_Group2PTD30               = (uint64_t)(1ULL << 28), /**< TSPC pad mask PTD30 in group 2 */
    kTSPC_Group2PTD31               = (uint64_t)(1ULL << 29), /**< TSPC pad mask PTD31 in group 2 */
    kTSPC_Group2PTE17               = (uint64_t)(1ULL << 30), /**< TSPC pad mask PTE17 in group 2 */
    kTSPC_Group2PTE18               = (uint64_t)(1ULL << 31), /**< TSPC pad mask PTE18 in group 2 */
    kTSPC_Group2PTE21               = (uint64_t)(1ULL << 32), /**< TSPC pad mask PTE21 in group 2 */
    kTSPC_Group2PTE22               = (uint64_t)(1ULL << 33), /**< TSPC pad mask PTE22 in group 2 */
    kTSPC_Group2PTE23               = (uint64_t)(1ULL << 34), /**< TSPC pad mask PTE23 in group 2 */
    kTSPC_Group2PTE24               = (uint64_t)(1ULL << 35), /**< TSPC pad mask PTE24 in group 2 */
    kTSPC_Group2PTE25               = (uint64_t)(1ULL << 36), /**< TSPC pad mask PTE25 in group 2 */
    kTSPC_Group2PTE26               = (uint64_t)(1ULL << 37), /**< TSPC pad mask PTE26 in group 2 */
} tspc_group2_pads_t;

/* @} */

/*!
 * @addtogroup xbic
 * @{
 */

