zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE316/MCXE316_COMMON.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the XBIC Master Port
 *
 * Defines the structure for the xbic master port collections.
 */
typedef enum _xbic_master_port
{
    kXbicAxbsMasterCortexM70Ahbm    = 0U,          /**< Cortex-M7 AHBM */
    kXbicAxbsPeriMasterCortexM70Ahbp = 0U,         /**< Cortex-M7 AHBP */
    kXbicAxbsEdmaMasterEdma         = 0U,          /**< EDMA */
    kXbicAxbsTcmMasterAxbs3         = 0U,          /**< AXBS3 */
    kXbicAxbsMasterAxbs2S0          = 1U,          /**< AXBS2 S0 */
    kXbicAxbsPeriMasterAxbs2S1      = 1U,          /**< AXBS2 S1 */
    kXbicAxbsMasterHseB             = 2U,          /**< HSE-B */
    kXbicAxbsPeriMasterHseB         = 2U,          /**< HSE-B */
    kkXbicAxbsMasterEmac            = 3U,          /**< EMAC */
} xbic_master_port_t;

/* @} */

/*!
 * @brief Structure for the XBIC Slave Port
 *
 * Defines the structure for the XBIC Slave Port collections.
 */
typedef enum _xbic_slave_port
{
    kXbicAxbsSlaveFlashMemoryPort0  = 0U,          /**< Flash Memory port0 */
    kXbicAxbsPeriSlaveAips0         = 0U,          /**< AIPS0 */
    kXbicAxbsEdmaSlaveAxbs0M1       = 0U,          /**< AXBS0 M1 */
    kXbicAxbsTcmSlaveCortexM70Tcm   = 0U,          /**< TCM */
    kXbicAxbsSlaveFlashMemoryPort1  = 1U,          /**< Flash Memory port1 */
    kXbicAxbsPeriSlaveAips1         = 1U,          /**< AIPS1 */
    kXbicAxbsEdmaSlaveAxbs1M1       = 1U,          /**< AXBS1 M1 */
    kXbicAxbsSlavePram0             = 2U,          /**< PRAM0 */
    kXbicAxbsPeriSlaveAips2         = 2U,          /**< AIPS2 */
    kXbicAxbsSlaveCortexM7Tcm       = 3U,          /**< TCM */
    kXbicAxbsSlaveFlashMemoryPort2  = 4U,          /**< Flash Memory port2 */
    kXbicAxbsSlaveQuadSpi           = 5U,          /**< QSPI */
    kXbicAxbsSlavePram1             = 6U,          /**< PRAM1 */
} xbic_slave_port_t;

/* @} */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ADC - Peripheral instance base addresses */
/** Peripheral ADC_0 base address */
#define ADC_0_BASE                               (0x400A0000u)
/** Peripheral ADC_0 base pointer */
#define ADC_0                                    ((ADC_Type *)ADC_0_BASE)
/** Peripheral ADC_1 base address */
#define ADC_1_BASE                               (0x400A4000u)
/** Peripheral ADC_1 base pointer */
#define ADC_1                                    ((ADC_Type *)ADC_1_BASE)
/** Array initializer of ADC peripheral base addresses */
#define ADC_BASE_ADDRS                           { ADC_0_BASE, ADC_1_BASE }
/** Array initializer of ADC peripheral base pointers */
#define ADC_BASE_PTRS                            { ADC_0, ADC_1 }
/** Interrupt vectors for the ADC peripheral type */
#define ADC_IRQS                                 { ADC0_IRQn, ADC1_IRQn }

/* BCTU - Peripheral instance base addresses */
/** Peripheral BCTU base address */
#define BCTU_BASE                                (0x40084000u)
/** Peripheral BCTU base pointer */
#define BCTU                                     ((BCTU_Type *)BCTU_BASE)
/** Array initializer of BCTU peripheral base addresses */
#define BCTU_BASE_ADDRS                          { BCTU_BASE }
/** Array initializer of BCTU peripheral base pointers */
#define BCTU_BASE_PTRS                           { BCTU }

/* CAN - Peripheral instance base addresses */
/** Peripheral FLEXCAN_0 base address */
#define FLEXCAN_0_BASE                           (0x40304000u)
/** Peripheral FLEXCAN_0 base pointer */
#define FLEXCAN_0                                ((CAN_Type *)FLEXCAN_0_BASE)
/** Peripheral FLEXCAN_1 base address */
#define FLEXCAN_1_BASE                           (0x40308000u)
/** Peripheral FLEXCAN_1 base pointer */
#define FLEXCAN_1                                ((CAN_Type *)FLEXCAN_1_BASE)
/** Peripheral FLEXCAN_2 base address */
#define FLEXCAN_2_BASE                           (0x4030C000u)
/** Peripheral FLEXCAN_2 base pointer */
#define FLEXCAN_2                                ((CAN_Type *)FLEXCAN_2_BASE)
/** Array initializer of CAN peripheral base addresses */
#define CAN_BASE_ADDRS                           { FLEXCAN_0_BASE, FLEXCAN_1_BASE, FLEXCAN_2_BASE }
/** Array initializer of CAN peripheral base pointers */
#define CAN_BASE_PTRS                            { FLEXCAN_0, FLEXCAN_1, FLEXCAN_2 }
/** Interrupt vectors for the CAN peripheral type */
#define CAN_Rx_Warning_IRQS                      { FlexCAN0_0_IRQn, FlexCAN1_0_IRQn, FlexCAN2_0_IRQn }
#define CAN_Tx_Warning_IRQS                      { FlexCAN0_0_IRQn, FlexCAN1_0_IRQn, FlexCAN2_0_IRQn }
#define CAN_Wake_Up_IRQS                         { FlexCAN0_0_IRQn, FlexCAN1_0_IRQn, FlexCAN2_0_IRQn }
#define CAN_Error_IRQS                           { FlexCAN0_0_IRQn, FlexCAN1_0_IRQn, FlexCAN2_0_IRQn }
#define CAN_Bus_Off_IRQS                         { FlexCAN0_0_IRQn, FlexCAN1_0_IRQn, FlexCAN2_0_IRQn }
#define CAN_ORed_Message_buffer_IRQS             { { FlexCAN0_1_IRQn, FlexCAN0_2_IRQn, FlexCAN0_3_IRQn }, { FlexCAN1_1_IRQn, FlexCAN1_2_IRQn, NotAvail_IRQn }, { FlexCAN2_1_IRQn, FlexCAN2_2_IRQn, NotAvail_IRQn } }

/* CMU_FC - Peripheral instance base addresses */
/** Peripheral CMU_0 base address */
#define CMU_0_BASE                               (0x402BC000u)
/** Peripheral CMU_0 base pointer */
#define CMU_0                                    ((CMU_FC_Type *)CMU_0_BASE)
/** Peripheral CMU_3 base address */
#define CMU_3_BASE                               (0x402BC060u)
/** Peripheral CMU_3 base pointer */
#define CMU_3                                    ((CMU_FC_Type *)CMU_3_BASE)
/** Peripheral CMU_4 base address */
#define CMU_4_BASE                               (0x402BC080u)
/** Peripheral CMU_4 base pointer */
#define CMU_4                                    ((CMU_FC_Type *)CMU_4_BASE)
/** Peripheral CMU_5 base address */
#define CMU_5_BASE                               (0x402BC0A0u)
/** Peripheral CMU_5 base pointer */
#define CMU_5                                    ((CMU_FC_Type *)CMU_5_BASE)
/** Array initializer of CMU_FC peripheral base addresses */
#define CMU_FC_BASE_ADDRS                        { CMU_0_BASE, CMU_3_BASE, CMU_4_BASE, CMU_5_BASE }
/** Array initializer of CMU_FC peripheral base pointers */
#define CMU_FC_BASE_PTRS                         { CMU_0, CMU_3, CMU_4, CMU_5 }

