zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE316/MCXE316_COMMON.h
/* FCCU - Peripheral instance base addresses */
/** Peripheral FCCU base address */
#define FCCU_BASE                                (0x40384000u)
/** Peripheral FCCU base pointer */
#define FCCU                                     ((FCCU_Type *)FCCU_BASE)
/** Array initializer of FCCU peripheral base addresses */
#define FCCU_BASE_ADDRS                          { FCCU_BASE }
/** Array initializer of FCCU peripheral base pointers */
#define FCCU_BASE_PTRS                           { FCCU }

/* FIRC - Peripheral instance base addresses */
/** Peripheral FIRC base address */
#define FIRC_BASE                                (0x402D0000u)
/** Peripheral FIRC base pointer */
#define FIRC                                     ((FIRC_Type *)FIRC_BASE)
/** Array initializer of FIRC peripheral base addresses */
#define FIRC_BASE_ADDRS                          { FIRC_BASE }
/** Array initializer of FIRC peripheral base pointers */
#define FIRC_BASE_PTRS                           { FIRC }

/* FLASH - Peripheral instance base addresses */
/** Peripheral FLASH base address */
#define FLASH_BASE                               (0x402EC000u)
/** Peripheral FLASH base pointer */
#define FLASH                                    ((FLASH_Type *)FLASH_BASE)
/** Array initializer of FLASH peripheral base addresses */
#define FLASH_BASE_ADDRS                         { FLASH_BASE }
/** Array initializer of FLASH peripheral base pointers */
#define FLASH_BASE_PTRS                          { FLASH }

/* FLEXIO - Peripheral instance base addresses */
/** Peripheral FLEXIO base address */
#define FLEXIO_BASE                              (0x40324000u)
/** Peripheral FLEXIO base pointer */
#define FLEXIO                                   ((FLEXIO_Type *)FLEXIO_BASE)
/** Array initializer of FLEXIO peripheral base addresses */
#define FLEXIO_BASE_ADDRS                        { FLEXIO_BASE }
/** Array initializer of FLEXIO peripheral base pointers */
#define FLEXIO_BASE_PTRS                         { FLEXIO }
/** Interrupt vectors for the FLEXIO peripheral type */
#define FLEXIO_IRQS                              { FLEXIO_IRQn }

/* FXOSC - Peripheral instance base addresses */
/** Peripheral FXOSC base address */
#define FXOSC_BASE                               (0x402D4000u)
/** Peripheral FXOSC base pointer */
#define FXOSC                                    ((FXOSC_Type *)FXOSC_BASE)
/** Array initializer of FXOSC peripheral base addresses */
#define FXOSC_BASE_ADDRS                         { FXOSC_BASE }
/** Array initializer of FXOSC peripheral base pointers */
#define FXOSC_BASE_PTRS                          { FXOSC }

/* INTM - Peripheral instance base addresses */
/** Peripheral INTM base address */
#define INTM_BASE                                (0x4027C000u)
/** Peripheral INTM base pointer */
#define INTM                                     ((INTM_Type *)INTM_BASE)
/** Array initializer of INTM peripheral base addresses */
#define INTM_BASE_ADDRS                          { INTM_BASE }
/** Array initializer of INTM peripheral base pointers */
#define INTM_BASE_PTRS                           { INTM }

/* JDC - Peripheral instance base addresses */
/** Peripheral JDC base address */
#define JDC_BASE                                 (0x40394000u)
/** Peripheral JDC base pointer */
#define JDC                                      ((JDC_Type *)JDC_BASE)
/** Array initializer of JDC peripheral base addresses */
#define JDC_BASE_ADDRS                           { JDC_BASE }
/** Array initializer of JDC peripheral base pointers */
#define JDC_BASE_PTRS                            { JDC }

/* LCU - Peripheral instance base addresses */
/** Peripheral LCU_0 base address */
#define LCU_0_BASE                               (0x40098000u)
/** Peripheral LCU_0 base pointer */
#define LCU_0                                    ((LCU_Type *)LCU_0_BASE)
/** Peripheral LCU_1 base address */
#define LCU_1_BASE                               (0x4009C000u)
/** Peripheral LCU_1 base pointer */
#define LCU_1                                    ((LCU_Type *)LCU_1_BASE)
/** Array initializer of LCU peripheral base addresses */
#define LCU_BASE_ADDRS                           { LCU_0_BASE, LCU_1_BASE }
/** Array initializer of LCU peripheral base pointers */
#define LCU_BASE_PTRS                            { LCU_0, LCU_1 }
/** Interrupt vectors for the LCU peripheral type */
#define LCU_IRQS                                 { LCU0_IRQn, LCU1_IRQn }

/* LPCMP - Peripheral instance base addresses */
/** Peripheral LPCMP_0 base address */
#define LPCMP_0_BASE                             (0x40370000u)
/** Peripheral LPCMP_0 base pointer */
#define LPCMP_0                                  ((LPCMP_Type *)LPCMP_0_BASE)
/** Array initializer of LPCMP peripheral base addresses */
#define LPCMP_BASE_ADDRS                         { LPCMP_0_BASE }
/** Array initializer of LPCMP peripheral base pointers */
#define LPCMP_BASE_PTRS                          { LPCMP_0 }
/** Interrupt vectors for the LPCMP peripheral type */
#define LPCMP_IRQS                               { CMP0_IRQn }

/* LPI2C - Peripheral instance base addresses */
/** Peripheral LPI2C_0 base address */
#define LPI2C_0_BASE                             (0x40350000u)
/** Peripheral LPI2C_0 base pointer */
#define LPI2C_0                                  ((LPI2C_Type *)LPI2C_0_BASE)
/** Peripheral LPI2C_1 base address */
#define LPI2C_1_BASE                             (0x40354000u)
/** Peripheral LPI2C_1 base pointer */
#define LPI2C_1                                  ((LPI2C_Type *)LPI2C_1_BASE)
/** Array initializer of LPI2C peripheral base addresses */
#define LPI2C_BASE_ADDRS                         { LPI2C_0_BASE, LPI2C_1_BASE }
/** Array initializer of LPI2C peripheral base pointers */
#define LPI2C_BASE_PTRS                          { LPI2C_0, LPI2C_1 }
/** Interrupt vectors for the LPI2C peripheral type */
#define LPI2C_IRQS                               { LPI2C0_IRQn, LPI2C1_IRQn }

/* LPSPI - Peripheral instance base addresses */
/** Peripheral LPSPI_0 base address */
#define LPSPI_0_BASE                             (0x40358000u)
/** Peripheral LPSPI_0 base pointer */
#define LPSPI_0                                  ((LPSPI_Type *)LPSPI_0_BASE)
/** Peripheral LPSPI_1 base address */
#define LPSPI_1_BASE                             (0x4035C000u)
/** Peripheral LPSPI_1 base pointer */
#define LPSPI_1                                  ((LPSPI_Type *)LPSPI_1_BASE)
/** Peripheral LPSPI_2 base address */
#define LPSPI_2_BASE                             (0x40360000u)
/** Peripheral LPSPI_2 base pointer */
#define LPSPI_2                                  ((LPSPI_Type *)LPSPI_2_BASE)
/** Peripheral LPSPI_3 base address */
#define LPSPI_3_BASE                             (0x40364000u)
/** Peripheral LPSPI_3 base pointer */
#define LPSPI_3                                  ((LPSPI_Type *)LPSPI_3_BASE)
/** Array initializer of LPSPI peripheral base addresses */
#define LPSPI_BASE_ADDRS                         { LPSPI_0_BASE, LPSPI_1_BASE, LPSPI_2_BASE, LPSPI_3_BASE }
/** Array initializer of LPSPI peripheral base pointers */
#define LPSPI_BASE_PTRS                          { LPSPI_0, LPSPI_1, LPSPI_2, LPSPI_3 }
/** Interrupt vectors for the LPSPI peripheral type */
#define LPSPI_IRQS                               { LPSPI0_IRQn, LPSPI1_IRQn, LPSPI2_IRQn, LPSPI3_IRQn }

/* LPUART - Peripheral instance base addresses */
/** Peripheral LPUART_0 base address */
#define LPUART_0_BASE                            (0x40328000u)
/** Peripheral LPUART_0 base pointer */
#define LPUART_0                                 ((LPUART_Type *)LPUART_0_BASE)
/** Peripheral LPUART_1 base address */
#define LPUART_1_BASE                            (0x4032C000u)
/** Peripheral LPUART_1 base pointer */
#define LPUART_1                                 ((LPUART_Type *)LPUART_1_BASE)
/** Peripheral LPUART_2 base address */
#define LPUART_2_BASE                            (0x40330000u)
/** Peripheral LPUART_2 base pointer */
#define LPUART_2                                 ((LPUART_Type *)LPUART_2_BASE)
/** Peripheral LPUART_3 base address */
#define LPUART_3_BASE                            (0x40334000u)
/** Peripheral LPUART_3 base pointer */
#define LPUART_3                                 ((LPUART_Type *)LPUART_3_BASE)
/** Array initializer of LPUART peripheral base addresses */
#define LPUART_BASE_ADDRS                        { LPUART_0_BASE, LPUART_1_BASE, LPUART_2_BASE, LPUART_3_BASE }
/** Array initializer of LPUART peripheral base pointers */
#define LPUART_BASE_PTRS                         { LPUART_0, LPUART_1, LPUART_2, LPUART_3 }
/** Interrupt vectors for the LPUART peripheral type */
#define LPUART_RX_TX_IRQS                        { LPUART_0_IRQn, LPUART_1_IRQn, LPUART_2_IRQn, LPUART_3_IRQn }

/* MCM - Peripheral instance base addresses */
/** Peripheral MCM_0 base address */
#define MCM_0_BASE                               (0xE0080000u)
/** Peripheral MCM_0 base pointer */
#define MCM_0                                    ((MCM_Type *)MCM_0_BASE)
/** Array initializer of MCM peripheral base addresses */
#define MCM_BASE_ADDRS                           { MCM_0_BASE }
/** Array initializer of MCM peripheral base pointers */
#define MCM_BASE_PTRS                            { MCM_0 }

/* MC_CGM - Peripheral instance base addresses */
/** Peripheral MC_CGM base address */
#define MC_CGM_BASE                              (0x402D8000u)
/** Peripheral MC_CGM base pointer */
#define MC_CGM                                   ((MC_CGM_Type *)MC_CGM_BASE)
/** Array initializer of MC_CGM peripheral base addresses */
#define MC_CGM_BASE_ADDRS                        { MC_CGM_BASE }
/** Array initializer of MC_CGM peripheral base pointers */
#define MC_CGM_BASE_PTRS                         { MC_CGM }

/* MC_ME - Peripheral instance base addresses */
/** Peripheral MC_ME base address */
#define MC_ME_BASE                               (0x402DC000u)
/** Peripheral MC_ME base pointer */
#define MC_ME                                    ((MC_ME_Type *)MC_ME_BASE)
/** Array initializer of MC_ME peripheral base addresses */
#define MC_ME_BASE_ADDRS                         { MC_ME_BASE }
/** Array initializer of MC_ME peripheral base pointers */
#define MC_ME_BASE_PTRS                          { MC_ME }

/* MC_RGM - Peripheral instance base addresses */
/** Peripheral MC_RGM base address */
#define MC_RGM_BASE                              (0x4028C000u)
/** Peripheral MC_RGM base pointer */
#define MC_RGM                                   ((MC_RGM_Type *)MC_RGM_BASE)
/** Array initializer of MC_RGM peripheral base addresses */
#define MC_RGM_BASE_ADDRS                        { MC_RGM_BASE }
/** Array initializer of MC_RGM peripheral base pointers */
#define MC_RGM_BASE_PTRS                         { MC_RGM }

/* MDM_AP - Peripheral instance base addresses */
/** Peripheral MDM_AP base address */
#define MDM_AP_BASE                              (0x40250600u)
/** Peripheral MDM_AP base pointer */
#define MDM_AP                                   ((MDM_AP_Type *)MDM_AP_BASE)
/** Array initializer of MDM_AP peripheral base addresses */
#define MDM_AP_BASE_ADDRS                        { MDM_AP_BASE }
/** Array initializer of MDM_AP peripheral base pointers */
#define MDM_AP_BASE_PTRS                         { MDM_AP }

/* MSCM - Peripheral instance base addresses */
/** Peripheral MSCM base address */
#define MSCM_BASE                                (0x40260000u)
/** Peripheral MSCM base pointer */
#define MSCM                                     ((MSCM_Type *)MSCM_BASE)
/** Array initializer of MSCM peripheral base addresses */
#define MSCM_BASE_ADDRS                          { MSCM_BASE }
/** Array initializer of MSCM peripheral base pointers */
#define MSCM_BASE_PTRS                           { MSCM }

/* MU - Peripheral instance base addresses */
/** Peripheral MU0_B base address */
#define MU0_B_BASE                               (0x4038C000u)
/** Peripheral MU0_B base pointer */
#define MU0_B                                    ((MU_Type *)MU0_B_BASE)
/** Peripheral MU1_B base address */
#define MU1_B_BASE                               (0x40390000u)
/** Peripheral MU1_B base pointer */
#define MU1_B                                    ((MU_Type *)MU1_B_BASE)
/** Array initializer of MU peripheral base addresses */
#define MU_BASE_ADDRS                            { MU0_B_BASE, MU1_B_BASE }
/** Array initializer of MU peripheral base pointers */
#define MU_BASE_PTRS                             { MU0_B, MU1_B }

/* PFLASH - Peripheral instance base addresses */
/** Peripheral PFLASH base address */
#define PFLASH_BASE                              (0x40268000u)
/** Peripheral PFLASH base pointer */
#define PFLASH                                   ((PFLASH_Type *)PFLASH_BASE)
/** Array initializer of PFLASH peripheral base addresses */
#define PFLASH_BASE_ADDRS                        { PFLASH_BASE }
/** Array initializer of PFLASH peripheral base pointers */
#define PFLASH_BASE_PTRS                         { PFLASH }

/* PIT - Peripheral instance base addresses */
/** Peripheral PIT_0 base address */
#define PIT_0_BASE                               (0x400B0000u)
/** Peripheral PIT_0 base pointer */
#define PIT_0                                    ((PIT_Type *)PIT_0_BASE)
/** Peripheral PIT_1 base address */
#define PIT_1_BASE                               (0x400B4000u)
/** Peripheral PIT_1 base pointer */
#define PIT_1                                    ((PIT_Type *)PIT_1_BASE)
/** Array initializer of PIT peripheral base addresses */
#define PIT_BASE_ADDRS                           { PIT_0_BASE, PIT_1_BASE }
/** Array initializer of PIT peripheral base pointers */
#define PIT_BASE_PTRS                            { PIT_0, PIT_1 }
/** Interrupt vectors for the PIT peripheral type */
#define PIT_IRQS                                 { { PIT0_IRQn, PIT0_IRQn, PIT0_IRQn, PIT0_IRQn }, { PIT1_IRQn, PIT1_IRQn, PIT1_IRQn, PIT1_IRQn } }

